; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v3)
             (pred_9 ?v9 ?v2)
             (pred_4 ?v8 ?v2)
             (pred_10 ?v11 ?v8 )
	     (pred_3 ?v8)
             (pred_11 ?v6)
             (pred_8 ?v9)
             (pred_5 ?v2)
             (pred_6 ?v8)
             (pred_1 ?v9)
             (pred_2 ?v8)
             (pred_12 ))



(:action op_2
:parameters (?v10 ?v12 ?v13 ?v5)
:precondition (and (pred_11 ?v10) (pred_11 ?v12) (pred_8 ?v13) (pred_5 ?v5)
          (pred_7 ?v10 ?v12) (pred_9 ?v13 ?v5)
                   (pred_4 ?v12 ?v5) (pred_3 ?v10) 
                   (pred_6 ?v12) (pred_1 ?v13))
:effect (and  (pred_2 ?v12) (not (pred_6 ?v12))))


(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_11 ?v10) (pred_11 ?v4)
               (pred_3 ?v10) (pred_7 ?v10 ?v4) (pred_2 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v10))))

(:action op_3
:parameters (?v10 ?v13)
:precondition (and (pred_11 ?v10) (pred_8 ?v13) 
                  (pred_3 ?v10) (pred_10 ?v13 ?v10) (pred_12 ))
:effect (and (pred_1 ?v13)
   (not (pred_10 ?v13 ?v10)) (not (pred_12 ))))


(:action op_5
:parameters (?v10 ?v1 ?v7)
:precondition (and (pred_11 ?v10) (pred_8 ?v1) (pred_8 ?v7)
                  (pred_3 ?v10) (pred_1 ?v7) (pred_10 ?v1 ?v10))
:effect (and (pred_1 ?v1) (pred_10 ?v7 ?v10)
        (not (pred_1 ?v7)) (not (pred_10 ?v1 ?v10))))

(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_11 ?v10) (pred_8 ?v13) 
                  (pred_3 ?v10) (pred_1 ?v13))
:effect (and (pred_12 ) (pred_10 ?v13 ?v10) (not (pred_1 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_10 obj_03 obj_14 obj_12 obj_11 obj_18 obj_02 obj_04 obj_20 obj_15 obj_13 obj_16 obj_19 obj_07 obj_09
    obj_08 obj_22 obj_01
    obj_21 obj_06 obj_05
    )

    (:init
       (pred_12)

       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_14)
       (pred_11 obj_12)
       (pred_11 obj_11)
       (pred_11 obj_18)
       (pred_11 obj_02)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_5 obj_08)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_06)
       (pred_8 obj_05)

       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_04 obj_16)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_07)
       (pred_6 obj_20)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_4  obj_20 obj_08)
       (pred_4  obj_04 obj_22)
       (pred_4  obj_13 obj_01)
       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_18)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_2 obj_16)
       (pred_2 obj_19)
       (pred_2 obj_07)
       (pred_2 obj_09)

       (pred_9  obj_21 obj_08)
       (pred_9  obj_06 obj_22)
       (pred_9  obj_05 obj_01)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_05 obj_11)
       (pred_3 obj_02)
    )

    (:goal (and
       (pred_10 obj_06 obj_12)
    ))
(:constraints
  (always (not (pred_3 obj_04)))
)
)

; plan
1. (op_1 obj_02 obj_18)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_15)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_15)
   goals met: 0 of 1
3. (op_1 obj_15 obj_07)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_07)
   goals met: 0 of 1
4. (op_1 obj_07 obj_19)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_19)
   goals met: 0 of 1
5. (op_3 obj_19 obj_06)
   deleted: (pred_10 obj_06 obj_19) (pred_12)
   added: (pred_1 obj_06)
   goals met: 0 of 1
6. (op_1 obj_19 obj_07)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_07)
   goals met: 0 of 1
7. (op_1 obj_07 obj_15)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_15)
   goals met: 0 of 1
8. (op_1 obj_15 obj_18)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_18)
   goals met: 0 of 1
9. (op_1 obj_18 obj_11)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_11)
   goals met: 0 of 1
10. (op_1 obj_11 obj_12)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_12)
   goals met: 0 of 1
11. (op_4 obj_12 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_12) (pred_10 obj_06 obj_12)
   goals met: 1 of 1
